/*
Localizable.strings
PanicGit

Created by Logan Collins on 2/24/18.
Copyright © 2018 Panic Inc. All rights reserved.
*/


// Operations

// "Downloading Objects: 12 of 100 (100KB)"
"Downloading Objects: %@ of %@ (%@)" = "正在下载对象：%@/%@ (%@)";

// "Indexing Deltas: 12 of 100"
"Indexing Deltas: %@ of %@" = "正在索引 Delta：%@/%@";

// "Packing Objects: 12 of 100"
"Packing Objects: %@ of %@" = "正在打包对象：%@/%@";

// "Uploading Objects: 12 of 100 (100KB)"
"Uploading Objects: %@ of %@ (%@)" = "正在上传对象：%@/%@ (%@)";

// "Checking Out Files: 12 of 100"
"Checking Out Files: %@ of %@" = "正在检出文件：%@/%@";


// SSH host key authentication
"The %@ %@ fingerprint is:\n%@" = "%@ %@ 指纹为：\n%@";


// Errors
"Error returned from libgit2: %@ (%ld)" = "libgit2 返回错误： %@ (%ld)";
"Error code from libgit2: (%ld)" = "libgit2 返回错误： (%ld)";

"The requested object was not found." = "找不到请求的对象。";
"The requested object already exists." = "请求的对象已存在。";
"Multiple ambiguous matching objects were found." = "找到多个模糊匹配对象。";
"The provided buffer was too short." = "提供的缓冲区过短。";
"This operation cannot be performed on a bare repository." = "此操作无法在裸存储库上执行。";
"The branch contains no commits." = "该分支不包含提交。";
"Unmerged changes must be resolved before the operation can be performed." = "必须先解决未合并的更改才能执行操作。";
"The reference cannot be fast-forwarded and must instead be merged or rebased." = "引用无法快进，并必须合并或变基。";
"The provided reference name or refspec was invalid." = "所提供的引用名称或引用规范无效。";
"One or more conflicts prevented the operation from being performed.\n\nCommit or stash any uncommitted changes and try again." = "一处或多处冲突导致该操作无法执行。\n\n请提交或隐藏任何未提交的更改并重试。";
"There are locked files which prevented the operation from being performed." = "有阻止执行操作的锁定文件存在。";
"The reference has been modified by another operation." = "该引用已由另一操作修改。";
"Credentials were not accepted by the server. Make sure your password or SSH key is set up correctly.\n\nIf you are using an SSH config file, make sure it is not unexpectedly overriding options for the host." = "服务器不接受凭证。确保您的密码或 SSH 密钥已正确设置。\n\n如果您在使用 SSH 配置文件，确保其不会意外地覆盖主机的选项。";
"The certificate for the server is invalid. Make sure you have a valid secure connection to the server and that there is not a proxy server that may be downgrading security." = "服务器的证书是无效的。请确保与服务器有有效的安全连接，且没有可能降低安全性的代理服务器。";
"The provided patch or merge has already been applied." = "所提供的修补程序或合并已经应用。";
"The requested peel operation is not possible." = "请求的剥离操作无法实现。";
"An unexpected end of file was encountered." = "文件意外终止。";
"The requested operation or input is invalid." = "请求的操作或输入无效。";
"There are uncommitted changes which must be committed or stashed before the operation can be performed." = "存在未提交的更改，必须在提交或储藏更改后才能执行操作。";
"This operation is not valid for the specified directory." = "此操作不适用于指定的目录。";
"There are merge conflicts which must be resolved before the operation can be performed." = "存在合并冲突，必须先解决该冲突才能执行操作。";
"The hash sum of one or more objects does not match." = "一个或多个对象的哈希和不匹配。";
"Unsaved changes in the index would be overridden by the operation." = "索引中未保存的更改会被该操作覆盖。";
"Failed to apply the patch." = "无法应用补丁。";
"The object is not owned by the current user." = "该对象不属于当前用户。";
"The operation was cancelled." = "该操作已被取消。";


// Tasks
"Failed to invoke Git “%@” hook." = "无法调用 Git “%@”挂钩。";
"Failed to invoke Git credential helper." = "无法调用 Git 凭据小助手。";

"Task “%@” terminated with an uncaught signal." = "任务“%@”以未捕获的信号终止。";
"Task “%@” terminated with a non-zero exit code: %d." = "任务“%@”以非零退出代码终止：%d。";


// Signing
"Invalid Git signing format specified." = "指定的 Git 签署格式无效。";
"The “gpg.format” configuration value is set to “%@”, which is not supported." = "“gpg.format”配置值被设为不受支持的“%@”。";
"Could not sign payload using %@." = "无法使用 %@ 签署有效负载。";
"A valid signing key was not provided using either `user.signingkey` or `gpg.ssh.defaultKeyCommand`." = "未使用 `user.signingkey` 或 `gpg.ssh.defaultKeyCommand` 提供有效的签名密钥。";
"Task “%@” did not generate a signature in its output." = "任务“%@”未在其输出中生成签名。";


// Apply Stash
"Applying stash…" = "正在应用储藏…";
"Failed to apply stash." = "应用储藏失败。";

// Checkout
"Checking out “%@”…" = "正在检出“%@”…";
"Checking out HEAD…" = "正在检出 HEAD…";

"Failed to checkout tree." = "检出工作树失败。";

// Cherry-pick
"Cherry-picking “%@”…" = "正在摘樱桃“%@”…";

"Failed to cherry-pick commits." = "摘樱桃提交失败。";

// Clone
"Cloning into “%@”…" = "克隆到“%@”…";

"Failed to clone repository." = "克隆存储库失败。";

// Commit
"Committing “%@”…" = "正在提交“%@”…";

"Failed to commit tree." = "提交工作树失败。";

// Fetch
"Fetching from “%@”…" = "从“%@”取得…";
"Fetching “%@” from “%@”…" = "从“%@”取得“%@”…";
"Fetching %@ refs from “%@”…" = "从“%@”取得 %@ 个引用…";

"Failed to fetch from “%@”." = "从“%@”取得失败。";

// List References
"Listing remote references for “%@”…" = "为“%@”列出远程引用…"; // Where a "reference" is a Git remote reference (such as a branch or tag)

"Failed to fetch remote references from “%@”." = "未能从“%@”取得远程引用。"; // Where a "reference" is a Git remote reference (such as a branch or tag)

// Merge
"Merging “%@”…" = "正在合并“%@”…";
"Merging %@ references…" = "正在合并 %@ 个引用…";

"Failed to merge references." = "无法合并引用。";

// Prune
"Pruning references for “%@”…" = "正在修剪“%@”的引用…";

"Failed to prune remote references from “%@”." = "无法从“%@”修剪远程引用。";

// Push
"Pushing to “%@”…" = "推送到“%@”…";
"Pushing “%@” to “%@”…" = "将“%@”推送到“%@”…";
"Pushing %@ refs to “%@”…" = "向“%@”推送 %@ 个引用…";

"Failed to push to “%@”." = "推送到“%@”失败。";

"Failed to push some references." = "无法推送某些引用。";
"One or more references were rejected by the server." = "一个或多个引用被服务器拒绝。";

// Update submodule
"Updating submodule “%@”…" = "正在更新子模块“%@”…";

"Failed to update submodule “%@”." = "更新子模块失败。";
